public class lesson_15_25 {
    //Зарезервированные слова в Java

    //Циклы и ветвления
    //Циклы и ветвления тоже дают нам немаленький список ключевых слов:

    //
    //if
    //else
    //switch
    //case
    //default
    //while
    //do
    //for
    //break
    //continue

    //Всего 10 слов достаточно, чтобы в языке появились циклы нескольких видов, ветвления,
    //операторы управления прерыванием цикла (break и continue) и множественные ветвления (switch).
    //Со всеми этими ключевыми словами вы уже знакомы.
}
