public class lesson_15_01 {
    //Задачи программиста

    //Очень часто начинающие программисты представляют себе суть работы программиста совсем не так, как опытные программисты.
    //От новичка часто можно услышать «Программа работает, что вам еще нужно?».
    //Опытный же программист знает, что «работает правильно» — это только одно из требований к программе, причем даже не самое главное!

    //Читабельность кода
    //Самое главное — это чтобы код программы был понятен другим программистам.
    //Это важнее, чем правильно работающая программа. Гораздо важнее.
    //Если у вас есть неправильно работающая программа, вы можете ее исправить,
    //а если у вас есть программа, код которой непонятен, вы ничего не можете с ней сделать.
    //Просто возьмите любую скомпилированную программу, например, notepad (блокнот) и поменяйте у него цвет фона на красный.
    //Работающая программа у вас есть, понятного кода программы у вас нет: в такую программу невозможно вносить изменения.
    //Хрестоматийный пример — когда разработчики Microsoft убрали из Windows игру Pinball,
    //потому что не смогли портировать ее на 64-х разрядную архитектуру. Причем у них даже были ее исходники.
    //Просто они не могли понять, как работает написанный код.

    //Учет всех сценариев использования
    //Второе по важности требование к программе — это учет всех сценариев ее работы.
    //Зачастую все оказывается немного сложнее, чем кажется.
    //А «работа правильно» — это обычно только один из множества сценариев.
}
