public class lesson_15_28 {
    //Зарезервированные слова в Java

    //Работа с классами
    //В эту категорию входит 11 ключевых слов:

    //class
    //interface
    //enum
    //import
    //package
    //extends
    //implements
    //static
    //final
    //abstract
    //default

    //Их можно разделить на 4 группы.

    //Первая группа — создание классов: class, interface и enum. С объявлением class’а и enum’а вы уже познакомились.
    //Ключевое слово interface используется для объявления еще одной «разновидности классов» – интерфейсов.

    //Вторая группа — это уже известные вам ключевые слова package и import.
    //Package используется для того, чтобы описать пакет класса внутри файла класса.
    //А import — чтобы в нашем классе мы могли использовать короткие имена чужих классов.

    //Ключевые слова extends и implements используются для описания наследования. Их вы рассмотрите в самом начале квеста Java Core.

    //И наконец, последняя группа — это модификаторы static, final, default и abstract.
    //Про static и final вы уже немного знаете, а ключевое слово abstract используется для того, чтобы сделать класс или метод абстрактным.
    //Детальнее — при изучении наследования в квесте Java Core.
}
