public class lesson_15_29 {
    //Зарезервированные слова в Java

    //Работа с объектами и переменными
    //Еще 6 ключевых слов используются для работы с объектами, методами и переменными.

    //new
    //instanceof
    //this
    //super
    //return
    //var (начиная с Java 10)

    //Оператор new используется, чтобы создавать новые объекты — это вы уже знаете.

    //Оператор instanceof используется, чтобы проверить, что определенная переменная содержит ссылку на объект определенного типа.
    //С ним вы уже тоже знакомы.

    //Ключевое слово this используется, чтобы решать проблемы с затенением переменных и методов класса. Вы это тоже изучали.

    //Ключевое слово super — это аналог this, только при обращении к методам и переменным класса-родителя.
    //Класс родитель еще называют суперклассом.

    //Оператор return используется, чтобы вернуть значение функции, и попутно эту самую функцию завершить.

    //И наконец, var — это объявление переменной с автовыведением типа. Вы тоже с этим уже знакомы.
}
