public class lesson_15_24 {
    //Зарезервированные слова в Java

    //Примитивные типы

    //Как вы уже, скорее всего, запомнили, в Java есть 8 примитивных типов, и каждому из них соответствует свое ключевое слово:

    //byte
    //short
    //int
    //long
    //char
    //float
    //double
    //boolean
    //void

    //Если вы достаточно любознательны, скорее всего, уже пробовали назвать переменную именем int.
    //И конечно же, это у вас не получилось. Именно по причине того, что все имена примитивных типов являются зарезервированными словами.
    //Также в эту категорию можно отнести тип void.

}
