public class lesson_15_27 {
    //Зарезервированные слова в Java

    //Области видимости
    //Всего три ключевых слова, но вы уже с ними знакомы

    //private
    //protected
    //public

    //public разрешает доступ к методу/переменной/классу из любого места программы.

    //private запрещает доступ к методу/переменной/классу из любого места программы.
    //Доступ разрешен только внутри того же класса, что и метод, помеченный модификатором private.

    //protected работает так же, как и private, но еще разрешает обращаться к методу/переменной/классу из классов-наследников.
    //Преимущества этого модификатора станут вам более понятны, когда вы хорошо разберетесь с ООП и наследованием.
}
